{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v2.8.1", "signature": {"inputs": {"input_2:0": {"name": "input_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "51"}]}}}, "outputs": {"Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}]}}, "Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_1/class/Tensordot/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/class/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/class/Tensordot/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/class/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/class/Max/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/class/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/while/maximum_iterations", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_7/zeros", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_7/zeros_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/strided_slice", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_6/zeros", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_6/zeros_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/strided_slice", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/while/maximum_iterations", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_5/zeros", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_5/zeros_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/strided_slice", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_4/zeros", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_4/zeros_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/strided_slice", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_4/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_4/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_4/Read_2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_5/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_5/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_5/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_6/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_6/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_6/Read_2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_7/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_7/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_7/Read_2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/phase/Tensordot/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/phase/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/phase/Tensordot/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/phase/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "input_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "51"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/transpose", "op": "Transpose", "input": ["input_2", "StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/transpose", "StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/while", "op": "StatelessWhile", "input": ["StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/while/loop_counter", "StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/while/maximum_iterations", "StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/time", "StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/TensorArrayV2_1", "StatefulPartitionedCall/model_1/lstm_4/zeros", "StatefulPartitionedCall/model_1/lstm_4/zeros_1", "StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/strided_slice", "StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "StatefulPartitionedCall/model_1/lstm_4/Read/ReadVariableOp", "StatefulPartitionedCall/model_1/lstm_4/Read_1/ReadVariableOp", "StatefulPartitionedCall/model_1/lstm_4/Read_2/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "_read_only_resource_inputs": {"list": {}}, "_lower_using_switch_merge": {"b": false}, "_num_original_outputs": {"i": "11"}, "body": {"func": {"name": "__inference_while_body_26638_10182"}}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "cond": {"func": {"name": "__inference_while_cond_26637_295"}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "1"}, {"size": "128"}]}, {"dim": [{"size": "1"}, {"size": "128"}]}, {}, {}, {"dim": [{"size": "51"}, {"size": "512"}]}, {"dim": [{"size": "128"}, {"size": "512"}]}, {"dim": [{"size": "512"}]}]}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/while:3", "StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/model_1/lstm_4/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/while", "op": "StatelessWhile", "input": ["StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/while/loop_counter", "StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/while/maximum_iterations", "StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/time", "StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/TensorArrayV2_1", "StatefulPartitionedCall/model_1/lstm_5/zeros", "StatefulPartitionedCall/model_1/lstm_5/zeros_1", "StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/strided_slice", "StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "StatefulPartitionedCall/model_1/lstm_5/Read/ReadVariableOp", "StatefulPartitionedCall/model_1/lstm_5/Read_1/ReadVariableOp", "StatefulPartitionedCall/model_1/lstm_5/Read_2/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "cond": {"func": {"name": "__inference_while_cond_27072_11406"}}, "_lower_using_switch_merge": {"b": false}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "1"}, {"size": "64"}]}, {"dim": [{"size": "1"}, {"size": "64"}]}, {}, {}, {"dim": [{"size": "128"}, {"size": "256"}]}, {"dim": [{"size": "64"}, {"size": "256"}]}, {"dim": [{"size": "256"}]}]}}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "body": {"func": {"name": "__inference_while_body_27073_7854"}}, "_read_only_resource_inputs": {"list": {}}, "_num_original_outputs": {"i": "11"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/while:3", "StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/model_1/lstm_5/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/while", "op": "StatelessWhile", "input": ["StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/while/loop_counter", "StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/while/maximum_iterations", "StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/time", "StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/TensorArrayV2_1", "StatefulPartitionedCall/model_1/lstm_6/zeros", "StatefulPartitionedCall/model_1/lstm_6/zeros_1", "StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/strided_slice", "StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "StatefulPartitionedCall/model_1/lstm_6/Read/ReadVariableOp", "StatefulPartitionedCall/model_1/lstm_6/Read_1/ReadVariableOp", "StatefulPartitionedCall/model_1/lstm_6/Read_2/ReadVariableOp"], "attr": {"_read_only_resource_inputs": {"list": {}}, "parallel_iterations": {"i": "32"}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "body": {"func": {"name": "__inference_while_body_27508_9374"}}, "cond": {"func": {"name": "__inference_while_cond_27507_2303"}}, "_lower_using_switch_merge": {"b": false}, "_num_original_outputs": {"i": "11"}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "1"}, {"size": "32"}]}, {"dim": [{"size": "1"}, {"size": "32"}]}, {}, {}, {"dim": [{"size": "64"}, {"size": "128"}]}, {"dim": [{"size": "32"}, {"size": "128"}]}, {"dim": [{"size": "128"}]}]}}}}, {"name": "StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/while:3", "StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/model_1/lstm_6/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/while", "op": "StatelessWhile", "input": ["StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/while/loop_counter", "StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/while/maximum_iterations", "StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/time", "StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/TensorArrayV2_1", "StatefulPartitionedCall/model_1/lstm_7/zeros", "StatefulPartitionedCall/model_1/lstm_7/zeros_1", "StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/strided_slice", "StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "StatefulPartitionedCall/model_1/lstm_7/Read/ReadVariableOp", "StatefulPartitionedCall/model_1/lstm_7/Read_1/ReadVariableOp", "StatefulPartitionedCall/model_1/lstm_7/Read_2/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "body": {"func": {"name": "__inference_while_body_27943_492"}}, "_num_original_outputs": {"i": "11"}, "_read_only_resource_inputs": {"list": {}}, "cond": {"func": {"name": "__inference_while_cond_27942_8827"}}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "1"}, {"size": "16"}]}, {"dim": [{"size": "1"}, {"size": "16"}]}, {}, {}, {"dim": [{"size": "32"}, {"size": "64"}]}, {"dim": [{"size": "16"}, {"size": "64"}]}, {"dim": [{"size": "64"}]}]}}, "_lower_using_switch_merge": {"b": false}}}, {"name": "StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/while:3", "StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "StatefulPartitionedCall/model_1/class/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/model_1/class/Tensordot/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/phase/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_1/lstm_7/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/model_1/phase/Tensordot/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/class/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model_1/class/Tensordot/Reshape", "StatefulPartitionedCall/model_1/class/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model_1/phase/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model_1/phase/Tensordot/Reshape", "StatefulPartitionedCall/model_1/phase/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model_1/class/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model_1/class/Tensordot/MatMul", "StatefulPartitionedCall/model_1/class/Tensordot/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/phase/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model_1/phase/Tensordot/MatMul", "StatefulPartitionedCall/model_1/phase/Tensordot/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/class/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_1/class/Tensordot", "StatefulPartitionedCall/model_1/class/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_1/phase/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_1/phase/Tensordot", "StatefulPartitionedCall/model_1/phase/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_1/class/Max", "op": "Max", "input": ["StatefulPartitionedCall/model_1/class/BiasAdd", "StatefulPartitionedCall/model_1/class/Max/reduction_indices"], "attr": {"keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/model_1/phase/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/class/sub", "op": "Sub", "input": ["StatefulPartitionedCall/model_1/class/BiasAdd", "StatefulPartitionedCall/model_1/class/Max"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/class/Exp", "op": "Exp", "input": ["StatefulPartitionedCall/model_1/class/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/class/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/model_1/class/Exp", "StatefulPartitionedCall/model_1/class/Sum/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/class/truediv", "op": "RealDiv", "input": ["StatefulPartitionedCall/model_1/class/Exp", "StatefulPartitionedCall/model_1/class/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_1/class/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_while_cond_26637_295", "inputArg": [{"name": "while_while_loop_counter", "type": "DT_INT32"}, {"name": "while_while_maximum_iterations", "type": "DT_INT32"}, {"name": "while_placeholder", "type": "DT_INT32"}, {"name": "while_placeholder_1", "type": "DT_VARIANT"}, {"name": "while_placeholder_2", "type": "DT_FLOAT"}, {"name": "while_placeholder_3", "type": "DT_FLOAT"}, {"name": "while_less_strided_slice", "type": "DT_INT32"}, {"name": "while_while_cond_26637___redundant_placeholder0", "type": "DT_VARIANT"}, {"name": "while_while_cond_26637___redundant_placeholder1", "type": "DT_FLOAT"}, {"name": "while_while_cond_26637___redundant_placeholder2", "type": "DT_FLOAT"}, {"name": "while_while_cond_26637___redundant_placeholder3", "type": "DT_FLOAT"}], "outputArg": [{"name": "while_identity", "type": "DT_BOOL"}]}, "nodeDef": [{"name": "while/Less", "op": "Less", "input": ["while_placeholder", "while_less_strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}], "ret": {"while_identity": "while/Less:z:0"}, "argAttr": {"8": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "10": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "9": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "128"}]}]}}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "128"}]}]}}}}, "7": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}}}, {"signature": {"name": "__inference_while_body_26638_10182", "inputArg": [{"name": "while_while_loop_counter", "type": "DT_INT32"}, {"name": "while_while_maximum_iterations", "type": "DT_INT32"}, {"name": "while_placeholder", "type": "DT_INT32"}, {"name": "while_placeholder_1", "type": "DT_VARIANT"}, {"name": "while_placeholder_2", "type": "DT_FLOAT"}, {"name": "while_placeholder_3", "type": "DT_FLOAT"}, {"name": "while_strided_slice_0", "type": "DT_INT32"}, {"name": "while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "while_matmul_kernel_0", "type": "DT_FLOAT"}, {"name": "while_matmul_1_recurrent_kernel_0", "type": "DT_FLOAT"}, {"name": "while_biasadd_bias_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "while_identity", "type": "DT_INT32"}, {"name": "while_identity_1", "type": "DT_INT32"}, {"name": "while_identity_2", "type": "DT_INT32"}, {"name": "while_identity_3", "type": "DT_VARIANT"}, {"name": "while_identity_4", "type": "DT_FLOAT"}, {"name": "while_identity_5", "type": "DT_FLOAT"}, {"name": "while_strided_slice", "type": "DT_INT32"}, {"name": "while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor", "type": "DT_VARIANT"}, {"name": "while_matmul_kernel", "type": "DT_FLOAT"}, {"name": "while_matmul_1_recurrent_kernel", "type": "DT_FLOAT"}, {"name": "while_biasadd_bias", "type": "DT_FLOAT"}]}, "nodeDef": [{"name": "__inference_while_body_26638_10182/while/add_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_26638_10182/while/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_26638_10182/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_26638_10182/while/add_3/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "while/MatMul_1", "op": "MatMul", "input": ["while_placeholder_2", "while_matmul_1_recurrent_kernel_0"], "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "while/add_2", "op": "AddV2", "input": ["while_placeholder", "__inference_while_body_26638_10182/while/add_2/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor_0", "while_placeholder", "__inference_while_body_26638_10182/while/TensorArrayV2Read/TensorListGetItem/element_shape:output:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "while/add_3", "op": "AddV2", "input": ["while_while_loop_counter", "__inference_while_body_26638_10182/while/add_3/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "while/MatMul", "op": "MatMul", "input": ["while/TensorArrayV2Read/TensorListGetItem:item:0", "while_matmul_kernel_0"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "while/add", "op": "AddV2", "input": ["while/MatMul:product:0", "while/MatMul_1:product:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/BiasAdd", "op": "BiasAdd", "input": ["while/add:z:0", "while_biasadd_bias_0"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "while/split", "op": "Split", "input": ["__inference_while_body_26638_10182/while/split/split_dim:output:0", "while/BiasAdd:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "4"}}}, {"name": "while/Sigmoid", "op": "Sigmoid", "input": ["while/split:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/Sigmoid_1", "op": "Sigmoid", "input": ["while/split:output:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/Tanh", "op": "Tanh", "input": ["while/split:output:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/Sigmoid_2", "op": "Sigmoid", "input": ["while/split:output:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/mul", "op": "Mul", "input": ["while/Sigmoid_1:y:0", "while_placeholder_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/mul_1", "op": "Mul", "input": ["while/Sigmoid:y:0", "while/Tanh:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/add_1", "op": "AddV2", "input": ["while/mul:z:0", "while/mul_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/Tanh_1", "op": "Tanh", "input": ["while/add_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/mul_2", "op": "Mul", "input": ["while/Sigmoid_2:y:0", "while/Tanh_1:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["while_placeholder_1", "while_placeholder", "while/mul_2:z:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}], "ret": {"while_identity_1": "while_while_maximum_iterations", "while_identity_4": "while/mul_2:z:0", "while_identity": "while/add_3:z:0", "while_identity_5": "while/add_1:z:0", "while_identity_3": "while/TensorArrayV2Write/TensorListSetItem:output_handle:0", "while_matmul_kernel": "while_matmul_kernel_0", "while_biasadd_bias": "while_biasadd_bias_0", "while_matmul_1_recurrent_kernel": "while_matmul_1_recurrent_kernel_0", "while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor": "while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor_0", "while_identity_2": "while/add_2:z:0", "while_strided_slice": "while_strided_slice_0"}, "argAttr": {"6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "9": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "128"}, {"size": "512"}]}]}}}}, "5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "128"}]}]}}}}, "7": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "8": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "51"}, {"size": "512"}]}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "128"}]}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "10": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "512"}]}]}}}}}}, {"signature": {"name": "__inference_while_body_27508_9374", "inputArg": [{"name": "while_while_loop_counter", "type": "DT_INT32"}, {"name": "while_while_maximum_iterations", "type": "DT_INT32"}, {"name": "while_placeholder", "type": "DT_INT32"}, {"name": "while_placeholder_1", "type": "DT_VARIANT"}, {"name": "while_placeholder_2", "type": "DT_FLOAT"}, {"name": "while_placeholder_3", "type": "DT_FLOAT"}, {"name": "while_strided_slice_0", "type": "DT_INT32"}, {"name": "while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "while_matmul_kernel_0", "type": "DT_FLOAT"}, {"name": "while_matmul_1_recurrent_kernel_0", "type": "DT_FLOAT"}, {"name": "while_biasadd_bias_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "while_identity", "type": "DT_INT32"}, {"name": "while_identity_1", "type": "DT_INT32"}, {"name": "while_identity_2", "type": "DT_INT32"}, {"name": "while_identity_3", "type": "DT_VARIANT"}, {"name": "while_identity_4", "type": "DT_FLOAT"}, {"name": "while_identity_5", "type": "DT_FLOAT"}, {"name": "while_strided_slice", "type": "DT_INT32"}, {"name": "while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor", "type": "DT_VARIANT"}, {"name": "while_matmul_kernel", "type": "DT_FLOAT"}, {"name": "while_matmul_1_recurrent_kernel", "type": "DT_FLOAT"}, {"name": "while_biasadd_bias", "type": "DT_FLOAT"}]}, "nodeDef": [{"name": "__inference_while_body_27508_9374/while/add_2/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_while_body_27508_9374/while/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_27508_9374/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "__inference_while_body_27508_9374/while/add_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "while/MatMul_1", "op": "MatMul", "input": ["while_placeholder_2", "while_matmul_1_recurrent_kernel_0"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "while/add_2", "op": "AddV2", "input": ["while_placeholder", "__inference_while_body_27508_9374/while/add_2/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor_0", "while_placeholder", "__inference_while_body_27508_9374/while/TensorArrayV2Read/TensorListGetItem/element_shape:output:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "while/add_3", "op": "AddV2", "input": ["while_while_loop_counter", "__inference_while_body_27508_9374/while/add_3/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "while/MatMul", "op": "MatMul", "input": ["while/TensorArrayV2Read/TensorListGetItem:item:0", "while_matmul_kernel_0"], "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "while/add", "op": "AddV2", "input": ["while/MatMul:product:0", "while/MatMul_1:product:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/BiasAdd", "op": "BiasAdd", "input": ["while/add:z:0", "while_biasadd_bias_0"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "while/split", "op": "Split", "input": ["__inference_while_body_27508_9374/while/split/split_dim:output:0", "while/BiasAdd:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "4"}}}, {"name": "while/Sigmoid", "op": "Sigmoid", "input": ["while/split:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/Sigmoid_1", "op": "Sigmoid", "input": ["while/split:output:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/Tanh", "op": "Tanh", "input": ["while/split:output:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/Sigmoid_2", "op": "Sigmoid", "input": ["while/split:output:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/mul", "op": "Mul", "input": ["while/Sigmoid_1:y:0", "while_placeholder_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/mul_1", "op": "Mul", "input": ["while/Sigmoid:y:0", "while/Tanh:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/add_1", "op": "AddV2", "input": ["while/mul:z:0", "while/mul_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/Tanh_1", "op": "Tanh", "input": ["while/add_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/mul_2", "op": "Mul", "input": ["while/Sigmoid_2:y:0", "while/Tanh_1:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["while_placeholder_1", "while_placeholder", "while/mul_2:z:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}], "ret": {"while_identity_1": "while_while_maximum_iterations", "while_biasadd_bias": "while_biasadd_bias_0", "while_identity": "while/add_3:z:0", "while_identity_5": "while/add_1:z:0", "while_identity_2": "while/add_2:z:0", "while_matmul_1_recurrent_kernel": "while_matmul_1_recurrent_kernel_0", "while_strided_slice": "while_strided_slice_0", "while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor": "while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor_0", "while_identity_3": "while/TensorArrayV2Write/TensorListSetItem:output_handle:0", "while_identity_4": "while/mul_2:z:0", "while_matmul_kernel": "while_matmul_kernel_0"}, "argAttr": {"8": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "64"}, {"size": "128"}]}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "7": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "32"}]}]}}}}, "9": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "32"}, {"size": "128"}]}]}}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "10": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "128"}]}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "32"}]}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}}}, {"signature": {"name": "__inference_while_cond_27507_2303", "inputArg": [{"name": "while_while_loop_counter", "type": "DT_INT32"}, {"name": "while_while_maximum_iterations", "type": "DT_INT32"}, {"name": "while_placeholder", "type": "DT_INT32"}, {"name": "while_placeholder_1", "type": "DT_VARIANT"}, {"name": "while_placeholder_2", "type": "DT_FLOAT"}, {"name": "while_placeholder_3", "type": "DT_FLOAT"}, {"name": "while_less_strided_slice", "type": "DT_INT32"}, {"name": "while_while_cond_27507___redundant_placeholder0", "type": "DT_VARIANT"}, {"name": "while_while_cond_27507___redundant_placeholder1", "type": "DT_FLOAT"}, {"name": "while_while_cond_27507___redundant_placeholder2", "type": "DT_FLOAT"}, {"name": "while_while_cond_27507___redundant_placeholder3", "type": "DT_FLOAT"}], "outputArg": [{"name": "while_identity", "type": "DT_BOOL"}]}, "nodeDef": [{"name": "while/Less", "op": "Less", "input": ["while_placeholder", "while_less_strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}], "ret": {"while_identity": "while/Less:z:0"}, "argAttr": {"7": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "8": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "10": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "32"}]}]}}}}, "9": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "32"}]}]}}}}}}, {"signature": {"name": "__inference_while_cond_27942_8827", "inputArg": [{"name": "while_while_loop_counter", "type": "DT_INT32"}, {"name": "while_while_maximum_iterations", "type": "DT_INT32"}, {"name": "while_placeholder", "type": "DT_INT32"}, {"name": "while_placeholder_1", "type": "DT_VARIANT"}, {"name": "while_placeholder_2", "type": "DT_FLOAT"}, {"name": "while_placeholder_3", "type": "DT_FLOAT"}, {"name": "while_less_strided_slice", "type": "DT_INT32"}, {"name": "while_while_cond_27942___redundant_placeholder0", "type": "DT_VARIANT"}, {"name": "while_while_cond_27942___redundant_placeholder1", "type": "DT_FLOAT"}, {"name": "while_while_cond_27942___redundant_placeholder2", "type": "DT_FLOAT"}, {"name": "while_while_cond_27942___redundant_placeholder3", "type": "DT_FLOAT"}], "outputArg": [{"name": "while_identity", "type": "DT_BOOL"}]}, "nodeDef": [{"name": "while/Less", "op": "Less", "input": ["while_placeholder", "while_less_strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}], "ret": {"while_identity": "while/Less:z:0"}, "argAttr": {"4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "16"}]}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "7": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "9": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "16"}]}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "10": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "8": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}}}, {"signature": {"name": "__inference_while_body_27943_492", "inputArg": [{"name": "while_while_loop_counter", "type": "DT_INT32"}, {"name": "while_while_maximum_iterations", "type": "DT_INT32"}, {"name": "while_placeholder", "type": "DT_INT32"}, {"name": "while_placeholder_1", "type": "DT_VARIANT"}, {"name": "while_placeholder_2", "type": "DT_FLOAT"}, {"name": "while_placeholder_3", "type": "DT_FLOAT"}, {"name": "while_strided_slice_0", "type": "DT_INT32"}, {"name": "while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "while_matmul_kernel_0", "type": "DT_FLOAT"}, {"name": "while_matmul_1_recurrent_kernel_0", "type": "DT_FLOAT"}, {"name": "while_biasadd_bias_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "while_identity", "type": "DT_INT32"}, {"name": "while_identity_1", "type": "DT_INT32"}, {"name": "while_identity_2", "type": "DT_INT32"}, {"name": "while_identity_3", "type": "DT_VARIANT"}, {"name": "while_identity_4", "type": "DT_FLOAT"}, {"name": "while_identity_5", "type": "DT_FLOAT"}, {"name": "while_strided_slice", "type": "DT_INT32"}, {"name": "while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor", "type": "DT_VARIANT"}, {"name": "while_matmul_kernel", "type": "DT_FLOAT"}, {"name": "while_matmul_1_recurrent_kernel", "type": "DT_FLOAT"}, {"name": "while_biasadd_bias", "type": "DT_FLOAT"}]}, "nodeDef": [{"name": "__inference_while_body_27943_492/while/add_2/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_while_body_27943_492/while/split/split_dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": 