{"format": "graph-model", "generatedBy": "2.8.0", "convertedBy": "TensorFlow.js Converter v2.8.0", "signature": {"inputs": {"Placeholder:0": {"name": "Placeholder:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "outputs": {"MatMul:0": {"name": "MatMul:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Placeholder", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "2"}, {"size": "2"}]}}}}, {"name": "MatMul", "op": "MatMul", "input": ["Placeholder", "w"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}], "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["weights.bin"], "weights": [{"name": "w", "shape": [2, 2], "dtype": "float32"}]}]}
