{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_5","layers":[{"class_name":"Embedding","config":{"input_dim":100,"output_dim":20,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"embedding_Embedding2","trainable":true,"batch_input_shape":[null,10],"dtype":"float32"}},{"class_name":"GRU","config":{"units":4,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":true,"stateful":false,"unroll":false,"name":"gru_GRU1","trainable":true}}]},"keras_version":"tfjs-layers 0.0.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"embedding_Embedding2/embeddings","shape":[100,20],"dtype":"float32"},{"name":"gru_GRU1/kernel","shape":[20,12],"dtype":"float32"},{"name":"gru_GRU1/recurrent_kernel","shape":[4,12],"dtype":"float32"},{"name":"gru_GRU1/bias","shape":[12],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v0.0.0","convertedBy":null}