{
    "convertedBy": "TensorFlow.js Converter v1.2.7",
    "format": "graph-model",
    "generatedBy": "1.14.0",
    "modelTopology": {
        "library": {},
        "node": [
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "shape": {
                        "shape": {
                            "dim": [
                                {
                                    "size": "1"
                                },
                                {
                                    "size": "224"
                                },
                                {
                                    "size": "224"
                                },
                                {
                                    "size": "3"
                                }
                            ]
                        }
                    }
                },
                "name": "image",
                "op": "Placeholder"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "16"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035/lead_cell_0/op_0/depthwise_0/depthwise_kernel",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "24"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035/lead_cell_1/op_0/depthwise_0/depthwise_kernel",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "2"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/feature_extractor/Mean/reduction_indices",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "192"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035/cell_11/op_0/depthwise_0/depthwise_kernel",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "24"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035/cell_2/op_0/depthwise_0/depthwise_kernel",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "384"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035/cell_15/op_0/depthwise_0/depthwise_kernel",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "24"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035/cell_3/op_0/depthwise_0/depthwise_kernel",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1280"
                                    },
                                    {
                                        "size": "5"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035/output/fc/tf_layer/kernel",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "192"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035/lead_cell_12/op_0/depthwise_0/depthwise_kernel",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "24"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035/lead_cell_4/op_0/depthwise_0/depthwise_kernel",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "48"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035/cell_5/op_0/depthwise_0/depthwise_kernel",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "5"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035/output/fc/tf_layer/bias",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "48"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035/cell_6/op_0/depthwise_0/depthwise_kernel",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "384"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035/cell_13/op_0/depthwise_0/depthwise_kernel",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "96"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035/lead_cell_7/op_0/depthwise_0/depthwise_kernel",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "192"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035/cell_8/op_0/depthwise_0/depthwise_kernel",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "384"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035/lead_cell_16/op_0/depthwise_0/depthwise_kernel",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "384"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035/cell_14/op_0/depthwise_0/depthwise_kernel",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "192"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035/cell_9/op_0/depthwise_0/depthwise_kernel",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    }
                },
                "name": "ExpandDims/dim",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "192"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035/lead_cell_10/op_0/depthwise_0/depthwise_kernel",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "112"
                                    },
                                    {
                                        "size": "1280"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/lead_cell_17/op_0/conv2d_0/Conv2D/merged_input",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1280"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/lead_cell_17/op_0/bn_0/FusedBatchNorm/Offset",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "384"
                                    },
                                    {
                                        "size": "112"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/lead_cell_16/op_0/project_0/Conv2D/merged_input",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "112"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/lead_cell_16/op_0/bn2_0/FusedBatchNorm/Offset",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "384"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/lead_cell_16/op_0/bn1_0/FusedBatchNorm/Scaled",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "384"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/lead_cell_16/op_0/bn1_0/FusedBatchNorm/Offset",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "64"
                                    },
                                    {
                                        "size": "384"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/lead_cell_16/op_0/expand_0/Conv2D/merged_input",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "384"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/lead_cell_16/op_0/bn0_0/FusedBatchNorm/Offset",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "384"
                                    },
                                    {
                                        "size": "64"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/cell_15/op_0/project_0/Conv2D/merged_input",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "64"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/cell_15/op_0/bn2_0/FusedBatchNorm/Offset",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "384"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/cell_15/op_0/bn1_0/FusedBatchNorm/Scaled",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "384"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/cell_15/op_0/bn1_0/FusedBatchNorm/Offset",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "64"
                                    },
                                    {
                                        "size": "384"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/cell_15/op_0/expand_0/Conv2D/merged_input",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "384"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/cell_15/op_0/bn0_0/FusedBatchNorm/Offset",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "384"
                                    },
                                    {
                                        "size": "64"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/cell_14/op_0/project_0/Conv2D/merged_input",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "64"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/cell_14/op_0/bn2_0/FusedBatchNorm/Offset",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "384"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/cell_14/op_0/bn1_0/FusedBatchNorm/Scaled",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "384"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/cell_14/op_0/bn1_0/FusedBatchNorm/Offset",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "64"
                                    },
                                    {
                                        "size": "384"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/cell_14/op_0/expand_0/Conv2D/merged_input",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "384"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/cell_14/op_0/bn0_0/FusedBatchNorm/Offset",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "384"
                                    },
                                    {
                                        "size": "64"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/cell_13/op_0/project_0/Conv2D/merged_input",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "64"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/cell_13/op_0/bn2_0/FusedBatchNorm/Offset",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "384"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/cell_13/op_0/bn1_0/FusedBatchNorm/Scaled",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "384"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/cell_13/op_0/bn1_0/FusedBatchNorm/Offset",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "64"
                                    },
                                    {
                                        "size": "384"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/cell_13/op_0/expand_0/Conv2D/merged_input",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "384"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/cell_13/op_0/bn0_0/FusedBatchNorm/Offset",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "192"
                                    },
                                    {
                                        "size": "64"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/lead_cell_12/op_0/project_0/Conv2D/merged_input",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "64"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/lead_cell_12/op_0/bn2_0/FusedBatchNorm/Offset",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "192"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/lead_cell_12/op_0/bn1_0/FusedBatchNorm/Scaled",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "192"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "mnas_v4_a_035_1/feature_network/lead_cell_12/op_0/bn1_0/FusedBatchNorm/Offset",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "32"
                                    },
                                    {
                                        "size": "192"
                                    }
                                ]
