{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "shape": [1], "name": "StatefulPartitionedCall/sequential/dense_Dense2/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [10, 1], "name": "StatefulPartitionedCall/sequential/dense_Dense2/MatMul/ReadVariableOp"}]}], "modelTopology": {"node": [{"attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}, "name": "dense_dense2_input", "op": "Placeholder"}, {"input": ["^dense_dense2_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "StatefulPartitionedCall/sequential/dense_Dense2/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^dense_dense2_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/sequential/dense_Dense2/MatMul/ReadVariableOp", "op": "Const"}, {"input": ["dense_dense2_input", "StatefulPartitionedCall/sequential/dense_Dense2/MatMul/ReadVariableOp"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/sequential/dense_Dense2/MatMul", "op": "MatMul"}, {"input": ["StatefulPartitionedCall/sequential/dense_Dense2/MatMul", "StatefulPartitionedCall/sequential/dense_Dense2/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "name": "StatefulPartitionedCall/sequential/dense_Dense2/BiasAdd", "op": "BiasAdd"}, {"input": ["StatefulPartitionedCall/sequential/dense_Dense2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "Identity", "op": "Identity"}], "versions": {"minConsumer": 12, "producer": 134}}, "generatedBy": "1.15.0", "convertedBy": "TensorFlow.js Converter v1.3.1.1", "format": "graph-model"}