{"format": "graph-model", "generatedBy": "2.14.0", "convertedBy": "TensorFlow.js Converter v4.4.0", "signature": {"inputs": {"previous_parent_scope_entity_displayed_status:0": {"name": "previous_parent_scope_entity_displayed_status:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "campaign_list_trigger_status:0": {"name": "campaign_list_trigger_status:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "new_place_id:0": {"name": "new_place_id:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "new_selected_ad_group:0": {"name": "new_selected_ad_group:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "depth:0": {"name": "depth:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "global_map_traffic_portion:0": {"name": "global_map_traffic_portion:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "595"}]}}, "trigger_status:0": {"name": "trigger_status:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "scoping_nav_candidate_count:0": {"name": "scoping_nav_candidate_count:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "position_changes_from_prev:0": {"name": "position_changes_from_prev:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "status:0": {"name": "status:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "cur_session_visits_count:0": {"name": "cur_session_visits_count:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "595"}]}}, "new_selected_campaign:0": {"name": "new_selected_campaign:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "visit_fraction_local:0": {"name": "visit_fraction_local:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "previous_selected_hierarchy_status:0": {"name": "previous_selected_hierarchy_status:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "campaign_type:0": {"name": "campaign_type:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "candidate_source:0": {"name": "candidate_source:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "parent_campaign_type:0": {"name": "parent_campaign_type:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "category:0": {"name": "category:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "position:0": {"name": "position:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "visit_num_local:0": {"name": "visit_num_local:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "ad_group_list_trigger_status:0": {"name": "ad_group_list_trigger_status:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "new_selected_scope_picker_entity_category:0": {"name": "new_selected_scope_picker_entity_category:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "previous_selected_scope_picker_entity_category:0": {"name": "previous_selected_scope_picker_entity_category:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "trigger_type:0": {"name": "trigger_type:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "predict_place_id:0": {"name": "predict_place_id:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "scope_picker_entity_list_trigger_status:0": {"name": "scope_picker_entity_list_trigger_status:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "new_parent_campaign_selected_status:0": {"name": "new_parent_campaign_selected_status:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "avg_visits_per_session_count:0": {"name": "avg_visits_per_session_count:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "595"}]}}, "visit_rank_local:0": {"name": "visit_rank_local:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "skinny_nav_candidate_count:0": {"name": "skinny_nav_candidate_count:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "previous_parent_campaign_selected_status:0": {"name": "previous_parent_campaign_selected_status:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "last_clicked_item_type:0": {"name": "last_clicked_item_type:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "new_selected_hierarchy_status:0": {"name": "new_selected_hierarchy_status:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "previous_selected_campaign:0": {"name": "previous_selected_campaign:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "previous_selected_ad_group:0": {"name": "previous_selected_ad_group:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "new_parent_scope_entity_displayed_status:0": {"name": "new_parent_scope_entity_displayed_status:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "probability_visit:0": {"name": "probability_visit:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "595"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/ExpandDims_9/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.reshape/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.one_hot/one_hot/depth", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/tf.one_hot/one_hot/on_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.one_hot/one_hot/off_value", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/tf.math.reduce_sum/Sum/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/tf.math.reduce_sum_1/Sum/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/tf.math.reduce_sum_2/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_17/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.reshape_2/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.one_hot_1/one_hot/depth", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.one_hot_1/one_hot/on_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.one_hot_1/one_hot/off_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.math.reduce_sum_3/Sum/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "unknown_20", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/model/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/embedding_17/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "unknown_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_1/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/embedding_12/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "unknown_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "19"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_2/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/embedding/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_3/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/embedding_21/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "unknown_16", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}, {"size": "6"}]}}}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_4/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/embedding_6/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "unknown_15", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_5/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/embedding_1/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "unknown_14", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_6/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/embedding_20/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_13", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_7/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/embedding_18/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_12", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_8/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/embedding_10/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_10/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_11/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "unknown_11", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_12/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/embedding_13/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "unknown_10", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "23"}, {"size": "6"}]}}}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_13/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/embedding_8/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_14/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/embedding_4/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "22"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_15/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/embedding_7/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_16/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/embedding_3/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "unknown_6", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_18/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/embedding_19/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_19/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/embedding_11/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_20/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_21/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_4", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_22/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/embedding_14/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "23"}, {"size": "6"}]}}}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_23/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/embedding_9/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_24/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/embedding_16/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_25/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_26/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "6"}]}}}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_27/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/embedding_5/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_28/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/embedding_15/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "29"}, {"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_29/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/embedding_2/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_30/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_31/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_32/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/concatenate_2/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/hidden_layer_1/MatMul/concat/concat/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3691"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/hidden_layer_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/hidden_layer_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model/hidden_layer_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model/hidden_layer_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model/hidden_layer_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model/probability_output/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/probability_output/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "ad_group_list_trigger_status", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "avg_visits_per_session_count", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "595"}]}}}}, {"name": "campaign_list_trigger_status", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "campaign_type", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "candidate_source", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "category", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "cur_session_visits_count", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "595"}]}}}}, {"name": "depth", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "global_map_traffic_portion", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "595"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "last_clicked_item_type", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "new_parent_campaign_selected_status", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "new_parent_scope_entity_displayed_status", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "new_place_id", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "new_selected_ad_group", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "new_selected_campaign", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "new_selected_hierarchy_status", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "new_selected_scope_picker_entity_category", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "parent_campaign_type", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "position", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "position_changes_from_prev", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "predict_place_id", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "previous_parent_campaign_selected_status", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "previous_parent_scope_entity_displayed_status", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "previous_selected_ad_group", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "previous_selected_campaign", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "previous_selected_hierarchy_status", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "previous_selected_scope_picker_entity_category", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "probability_visit", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "595"}]}}}}, {"name": "scope_picker_entity_list_trigger_status", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "scoping_nav_candidate_count", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "skinny_nav_candidate_count", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "status", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "trigger_status", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "trigger_type", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "visit_fraction_local", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "visit_num_local", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "visit_rank_local", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "StatefulPartitionedCall/model/ExpandDims", "op": "ExpandDims", "input": ["ad_group_list_trigger_status", "StatefulPartitionedCall/model/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_1", "op": "ExpandDims", "input": ["campaign_list_trigger_status", "StatefulPartitionedCall/model/ExpandDims_1/dim"], "attr": {"T": {"type": "DT_INT64"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_2", "op": "ExpandDims", "input": ["campaign_type", "StatefulPartitionedCall/model/ExpandDims_2/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_3", "op": "ExpandDims", "input": ["candidate_source", "StatefulPartitionedCall/model/ExpandDims_3/dim"], "attr": {"T": {"type": "DT_INT64"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_4", "op": "ExpandDims", "input": ["category", "StatefulPartitionedCall/model/ExpandDims_4/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_5", "op": "ExpandDims", "input": ["depth", "StatefulPartitionedCall/model/ExpandDims_5/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_6", "op": "ExpandDims", "input": ["last_clicked_item_type", "StatefulPartitionedCall/model/ExpandDims_6/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_7", "op": "ExpandDims", "input": ["new_parent_campaign_selected_status", "StatefulPartitionedCall/model/ExpandDims_7/dim"], "attr": {"T": {"type": "DT_INT64"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_8", "op": "ExpandDims", "input": ["new_parent_scope_entity_displayed_status", "StatefulPartitionedCall/model/ExpandDims_8/dim"], "attr": {"T": {"type": "DT_INT64"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_9", "op": "ExpandDims", "input": ["new_place_id", "StatefulPartitionedCall/model/ExpandDims_9/dim"], "attr": {"T": {"type": "DT_INT64"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_10", "op": "ExpandDims", "input": ["new_selected_ad_group", "StatefulPartitionedCall/model/ExpandDims_10/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_11", "op": "ExpandDims", "input": ["new_selected_campaign", "StatefulPartitionedCall/model/ExpandDims_11/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_12", "op": "ExpandDims", "input": ["new_selected_hierarchy_status", "StatefulPartitionedCall/model/ExpandDims_12/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_13", "op": "ExpandDims", "input": ["new_selected_scope_picker_entity_category", "StatefulPartitionedCall/model/ExpandDims_13/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_14", "op": "ExpandDims", "input": ["parent_campaign_type", "StatefulPartitionedCall/model/ExpandDims_14/dim"], "attr": {"T": {"type": "DT_INT64"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_15", "op": "ExpandDims", "input": ["position", "StatefulPartitionedCall/model/ExpandDims_15/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_16", "op": "ExpandDims", "input": ["position_changes_from_prev", "StatefulPartitionedCall/model/ExpandDims_16/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_17", "op": "ExpandDims", "input": ["predict_place_id", "StatefulPartitionedCall/model/ExpandDims_17/dim"], "attr": {"T": {"type": "DT_INT64"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_18", "op": "ExpandDims", "input": ["previous_parent_campaign_selected_status", "StatefulPartitionedCall/model/ExpandDims_18/dim"], "attr": {"T": {"type": "DT_INT64"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_19", "op": "ExpandDims", "input": ["previous_parent_scope_entity_displayed_status", "StatefulPartitionedCall/model/ExpandDims_19/dim"], "attr": {"T": {"type": "DT_INT64"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_20", "op": "ExpandDims", "input": ["previous_selected_ad_group", "StatefulPartitionedCall/model/ExpandDims_20/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_21", "op": "ExpandDims", "input": ["previous_selected_campaign", "StatefulPartitionedCall/model/ExpandDims_21/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_22", "op": "ExpandDims", "input": ["previous_selected_hierarchy_status", "StatefulPartitionedCall/model/ExpandDims_22/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_23", "op": "ExpandDims", "input": ["previous_selected_scope_picker_entity_category", "StatefulPartitionedCall/model/ExpandDims_23/dim"], "attr": {"T": {"type": "DT_INT64"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_24", "op": "ExpandDims", "input": ["scope_picker_entity_list_trigger_status", "StatefulPartitionedCall/model/ExpandDims_24/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_25", "op": "ExpandDims", "input": ["scoping_nav_candidate_count", "StatefulPartitionedCall/model/ExpandDims_25/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_26", "op": "ExpandDims", "input": ["skinny_nav_candidate_count", "StatefulPartitionedCall/model/ExpandDims_26/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_27", "op": "ExpandDims", "input": ["status", "StatefulPartitionedCall/model/ExpandDims_27/dim"], "attr": {"T": {"type": "DT_INT64"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_28", "op": "ExpandDims", "input": ["trigger_status", "StatefulPartitionedCall/model/ExpandDims_28/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_29", "op": "ExpandDims", "input": ["trigger_type", "StatefulPartitionedCall/model/ExpandDims_29/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_30", "op": "ExpandDims", "input": ["visit_fraction_local", "StatefulPartitionedCall/model/ExpandDims_30/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_31", "op": "ExpandDims", "input": ["visit_num_local", "StatefulPartitionedCall/model/ExpandDims_31/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/ExpandDims_32", "op": "ExpandDims", "input": ["visit_rank_local", "StatefulPartitionedCall/model/ExpandDims_32/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/embedding_17/embedding_lookup", "op": "GatherV2", "input": ["unknown_20", "StatefulPartitionedCall/model/ExpandDims", "StatefulPartitionedCall/model/embedding_17/embedding_lookup/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT64"}, "_has_manual_control_dependencies": {"b": true}, "Tindices": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/embedding_12/embedding_lookup", "op": "GatherV2", "input": ["unknown_19", "StatefulPartitionedCall/model/ExpandDims_1", "StatefulPartitionedCall/model/embedding_12/embedding_lookup/axis"], "attr": {"_has_manual_control_dependencies": {"b": true}, "Taxis": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown_18", "StatefulPartitionedCall/model/ExpandDims_2", "StatefulPartitionedCall/model/embedding/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT64"}, "Tindices": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/embedding_21/embedding_lookup", "op": "GatherV2", "input": ["unknown_17", "StatefulPartitionedCall/model/ExpandDims_3", "StatefulPartitionedCall/model/embedding_21/embedding_lookup/axis"], "attr": {"batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT64"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model/embedding_6/embedding_lookup", "op": "GatherV2", "input": ["unknown_16", "StatefulPartitionedCall/model/ExpandDims_4", "StatefulPartitionedCall/model/embedding_6/embedding_lookup/axis"], "attr": {"batch_dims": {"i": "0"}, "_has_manual_control_dependencies": {"b": true}, "Tindices": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/embedding_1/embedding_lookup", "op": "GatherV2", "input": ["unknown_15", "StatefulPartitionedCall/model/ExpandDims_5", "StatefulPartitionedCall/model/embedding_1/embedding_lookup/axis"], "attr": {"_has_manual_control_dependencies": {"b": true}, "Taxis": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/embedding_20/embedding_lookup", "op": "GatherV2", "input": ["unknown_14", "StatefulPartitionedCall/model/ExpandDims_6", "StatefulPartitionedCall/model/embedding_20/embedding_lookup/axis"], "attr": {"_has_manual_control_dependencies": {"b": true}, "Tindices": {"type": "DT_INT64"}, "Taxis": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/embedding_18/embedding_lookup", "op": "GatherV2", "input": ["unknown_13", "StatefulPartitionedCall/model/ExpandDims_7", "StatefulPartitionedCall/model/embedding_18/embedding_lookup/axis"], "attr": {"_has_manual_control_dependencies": {"b": true}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT64"}, "Tindices": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/embedding_10/embedding_lookup", "op": "GatherV2", "input": ["unknown_12", "StatefulPartitionedCall/model/ExpandDims_8", "StatefulPartitionedCall/model/embedding_10/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT64"}, "_has_manual_control_dependencies": {"b": true}, "Tindices": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/tf.reshape/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/ExpandDims_9", "StatefulPartitionedCall/model/tf.reshape/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/embedding_13/embedding_lookup", "op": "GatherV2", "input": ["unknown_11", "StatefulPartitionedCall/model/ExpandDims_12", "StatefulPartitionedCall/model/embedding_13/embedding_lookup/axis"], "attr": {"Tindices": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT64"}, "_has_manual_control_dependencies": {"b": true}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/embedding_8/embedding_lookup", "op": "GatherV2", "input": ["unknown_10", "StatefulPartitionedCall/model/ExpandDims_13", "StatefulPartitionedCall/model/embedding_8/embedding_lookup/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "Tindices": {"type": "DT_INT64"}, "Taxis": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/embedding_4/embedding_lookup", "op": "GatherV2", "input": ["unknown_9", "StatefulPartitionedCall/model/ExpandDims_14", "StatefulPartitionedCall/model/embedding_4/embedding_lookup/axis"], "attr": {"_has_manual_control_dependencies": {"b": true}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/embedding_7/embedding_lookup", "op": "GatherV2", "input": ["unknown_8", "StatefulPartitionedCall/model/ExpandDims_15", "StatefulPartitionedCall/model/embedding_7/embedding_lookup/axis"], "attr": {"batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT64"}, "_has_manual_control_dependencies": {"b": true}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/embedding_3/embedding_lookup", "op": "GatherV2", "input": ["unknown_7", "StatefulPartitionedCall/model/ExpandDims_16", "StatefulPartitionedCall/model/embedding_3/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT64"}, "_has_manual_control_dependencies": {"b": true}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/tf.reshape_2/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/ExpandDims_17", "StatefulPartitionedCall/model/tf.reshape_2/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/embedding_19/embedding_lookup", "op": "GatherV2", "input": ["unknown_6", "StatefulPartitionedCall/model/ExpandDims_18", "StatefulPartitionedCall/model/embedding_19/embedding_lookup/axis"], "attr": {"_has_manual_control_dependencies": {"b": true}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/embedding_11/embedding_lookup", "op": "GatherV2", "input": ["unknown_5", "StatefulPartitionedCall/model/ExpandDims_19", "StatefulPartitionedCall/model/embedding_11/embedding_lookup/axis"], "attr": {"_has_manual_control_dependencies": {"b": true}, "Tindices": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/embedding_14/embedding_lookup", "op": "GatherV2", "input": ["unknown_4", "StatefulPartitionedCall/model/ExpandDims_22", "StatefulPartitionedCall/model/embedding_14/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT64"}, "_has_manual_control_dependencies": {"b": true}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/embedding_9/embedding_lookup", "op": "GatherV2", "input": ["unknown_3", "StatefulPartitionedCall/model/ExpandDims_23", "StatefulPartitionedCall/model/embedding_9/embedding_lookup/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "Taxis": {"type": "DT_INT64"}, "Tindices": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/embedding_16/embedding_lookup", "op": "GatherV2", "input": ["unknown_2", "StatefulPartitionedCall/model/ExpandDims_24", "StatefulPartitionedCall/model/embedding_16/embedding_lookup/axis"], "attr": {"Tindices": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "Taxis": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/embedding_5/embedding_lookup", "op": "GatherV2", "input": ["unknown_1", "StatefulPartitionedCall/model/ExpandDims_27", "StatefulPartitionedCall/model/embedding_5/embedding_lookup/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT64"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model/embedding_15/embedding_lookup", "op": "GatherV2", "input": ["unknown_0", "StatefulPartitionedCall/model/ExpandDims_28", "StatefulPartitionedCall/model/embedding_15/embedding_lookup/axis"], "attr": {"_has_manual_control_dependencies": {"b": true}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/embedding_2/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/model/ExpandDims_29", "StatefulPartitionedCall/model/embedding_2/embedding_lookup/axis"], "attr": {"batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT64"}, "_has_manual_control_dependencies": {"b": true}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.squeeze_17/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/embedding_17/embedding_lookup"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.squeeze_12/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/embedding_12/embedding_lookup"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.squeeze/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/embedding/embedding_lookup"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.squeeze_21/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/embedding_21/embedding_lookup"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.squeeze_6/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/embedding_6/embedding_lookup"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.squeeze_1/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/embedding_1/embedding_lookup"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.squeeze_20/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/embedding_20/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.squeeze_18/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/embedding_18/embedding_lookup"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.squeeze_10/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/embedding_10/embedding_lookup"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.one_hot/one_hot", "op": "OneHot", "input": ["StatefulPartitionedCall/model/tf.reshape/Reshape", "StatefulPartitionedCall/model/tf.one_hot/one_hot/depth", "StatefulPartitionedCall/model/tf.one_hot/one_hot/on_value", "StatefulPartitionedCall/model/tf.one_hot/one_hot/off_value"], "attr": {"axis": {"i": "-1"}, "T": {"type": "DT_FLOAT"}, "TI": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.squeeze_13/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/embedding_13/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.squeeze_8/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/embedding_8/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.squeeze_4/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/embedding_4/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": 