{
  "format": "graph-model",
  "userDefinedMetadata": {
    "signature": {
      "inputs": {
        "input_1:0": {
          "dtype": "DT_FLOAT",
          "name": "input_1:0",
          "tensorShape": {
            "dim": [
              { "size": "-1" },
              { "size": "128" },
              { "size": "128" },
              { "size": "3" }
            ]
          }
        }
      },
      "outputs": {
        "Identity:0": {
          "dtype": "DT_FLOAT",
          "name": "Identity:0",
          "tensorShape": { "dim": [{ "size": "-1" }, { "size": "1" }] }
        },
        "Identity_1:0": {
          "dtype": "DT_FLOAT",
          "name": "Identity_1:0",
          "tensorShape": { "dim": [{ "size": "-1" }, { "size": "1404" }] }
        }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "shape": {
            "shape": {
              "dim": [
                { "size": "-1" },
                { "size": "128" },
                { "size": "128" },
                { "size": "3" }
              ]
            }
          }
        },
        "name": "input_1",
        "op": "Placeholder"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "16" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "16" },
                  { "size": "16" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_1/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "16" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_1/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "16" },
                  { "size": "16" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_2/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "16" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_2/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "16" },
                  { "size": "32" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_3/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_3/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "32" },
                  { "size": "32" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_4/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_4/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "32" },
                  { "size": "32" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_5/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_5/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "32" },
                  { "size": "64" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_6/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_6/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_7/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_7/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_8/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_8/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "128" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_9/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_9/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "128" },
                  { "size": "128" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_10/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_10/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "128" },
                  { "size": "128" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_11/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_11/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "128" },
                  { "size": "128" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_12/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_12/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "128" },
                  { "size": "128" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_13/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_13/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "128" },
                  { "size": "128" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_14/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_14/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "128" },
                  { "size": "128" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_15/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_15/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "128" },
                  { "size": "128" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_16/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_16/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "128" },
                  { "size": "128" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_17/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_17/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "128" },
                  { "size": "32" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_18/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_18/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "32" },
                  { "size": "32" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_19/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv2d_19/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "16" }]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/p_re_lu/Neg",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/depthwise_conv2d/depthwise/ReadVariableOp",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "16" }]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/p_re_lu_1/Neg",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise/ReadVariableOp",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "16" }]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/p_re_lu_2/Neg",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/channel_padding/Pad/paddings",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/depthwise_conv2d_2/depthwise/ReadVariableOp",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "32" }]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/p_re_lu_3/Neg",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/depthwise_conv2d_3/depthwise/ReadVariableOp",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "32" }]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/p_re_lu_4/Neg",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/depthwise_conv2d_4/depthwise/ReadVariableOp",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "32" }]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/p_re_lu_5/Neg",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/channel_padding_1/Pad/paddings",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/depthwise_conv2d_5/depthwise/ReadVariableOp",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "64" }]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/p_re_lu_6/Neg",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/depthwise_conv2d_6/depthwise/ReadVariableOp",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "64" }]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/p_re_lu_7/Neg",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/depthwise_conv2d_7/depthwise/ReadVariableOp",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "64" }]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/p_re_lu_8/Neg",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/channel_padding_2/Pad/paddings",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/depthwise_conv2d_8/depthwise/ReadVariableOp",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "128" }]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/p_re_lu_9/Neg",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/depthwise_conv2d_9/depthwise/ReadVariableOp",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "128" }]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/p_re_lu_10/Neg",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/depthwise_conv2d_10/depthwise/ReadVariableOp",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "128" }]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/p_re_lu_11/Neg",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/depthwise_conv2d_11/depthwise/ReadVariableOp",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "128" }]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/p_re_lu_12/Neg",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/depthwise_conv2d_12/depthwise/ReadVariableOp",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "128" }]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/p_re_lu_13/Neg",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/depthwise_conv2d_13/depthwise/ReadVariableOp",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "128" }]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/p_re_lu_14/Neg",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/depthwise_conv2d_14/depthwise/ReadVariableOp",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "128" }]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/p_re_lu_15/Neg",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "2" },
                  { "size": "2" },
                  { "size": "128" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/depthwise_conv2d_15/depthwise/ReadVariableOp",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "128" }]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/p_re_lu_16/Neg",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "2" },
                  { "size": "2" },
                  { "size": "128" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/depthwise_conv2d_16/depthwise/ReadVariableOp",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "128" }]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/p_re_lu_17/Neg",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "32" }]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/p_re_lu_18/Neg",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "2" },
                  { "size": "2" },
                  { "size": "32" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/depthwise_conv2d_17/depthwise/ReadVariableOp",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "32" }]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/p_re_lu_19/Neg",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "2" },
                  { "size": "2" },
                  { "size": "32" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv_face_flag/Conv2D/ReadVariableOp",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv_face_flag/BiasAdd/ReadVariableOp",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/output_faceflag/strided_slice/stack",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/output_faceflag/strided_slice/stack_1",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }
        },
        "name": "StatefulPartitionedCall/model/output_faceflag/Reshape/shape/1",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1404" }] }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv_mesh/BiasAdd/ReadVariableOp",
        "op": "Const"
      },
      {
        "input": ["^input_1"],
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "2" },
                  { "size": "2" },
                  { "size": "32" },
                  { "size": "1404" }
                ]
              }
            }
          }
        },
        "name": "StatefulPartitionedCall/model/conv_mesh/Conv2D/ReadVariableOp",
        "op": "Const"
      },
      {
        "device": "/device:CPU:0",
        "input": [
          "input_1",
          "StatefulPartitionedCall/model/conv2d/Conv2D_weights",
          "StatefulPartitionedCall/model/conv2d/Conv2D_bn_offset",
          "StatefulPartitionedCall/model/p_re_lu/Neg"
        ],
        "attr": {
          "explicit_paddings": { "list": {} },
          "epsilon": { "f": 0.0 },
          "data_format": { "s": "TkhXQw==" },
          "use_cudnn_on_gpu": { "b": true },
          "padding": { "s": "U0FNRQ==" },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "num_args": { "i": "2" },
          "T": { "type": "DT_FLOAT" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UHJlbHU="] } }
        },
        "name": "StatefulPartitionedCall/model/batch_normalization_v1/FusedBatchNormV3",
        "op": "_FusedConv2D"
      },
      {
        "input": [
          "^StatefulPartitionedCall/model/conv_face_flag/BiasAdd/ReadVariableOp",
          "^StatefulPartitionedCall/model/conv_face_flag/Conv2D/ReadVariableOp",
          "^StatefulPartitionedCall/model/conv_mesh/BiasAdd/ReadVariableOp",
          "^StatefulPartitionedCall/model/conv_mesh/Conv2D/ReadVariableOp",
          "^StatefulPartitionedCall/model/depthwise_conv2d/depthwise/ReadVariableOp",
          "^StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise/ReadVariableOp",
          "^StatefulPartitionedCall/model/depthwise_conv2d_10/depthwise/ReadVariableOp",
          "^StatefulPartitionedCall/model/depthwise_conv2d_11/depthwise/ReadVariableOp",
          "^StatefulPartitionedCall/model/depthwise_conv2d_12/depthwise/ReadVariableOp",
          "^StatefulPartitionedCall/model/depthwise_conv2d_13/depthwise/ReadVariableOp",
          "^StatefulPartitionedCall/model/depthwise_conv2d_14/depthwise/ReadVariableOp",
          "^StatefulPartitionedCall/model/depthwise_conv2d_15/depthwise/ReadVariableOp",
          "^StatefulPartitionedCall/model/depthwise_conv2d_16/depthwise/ReadVariableOp",
          "^StatefulPartitionedCall/model/depthwise_conv2d_17/depthwise/ReadVariableOp",
          "^StatefulPartitionedCall/model/depthwise_conv2d_2/depthwise/ReadVariableOp",
          "^StatefulPartitionedCall/model/depthwise_conv2d_3/depthwise/ReadVariableOp",
          "^StatefulPartitionedCall/model/depthwise_conv2d_4/depthwise/ReadVariableOp",
          "^StatefulPartitionedCall/model/depthwise_conv2d_5/depthwise/ReadVariableOp",
          "^StatefulPartitionedCall/model/depthwise_conv2d_6/depthwise/ReadVariableOp",
          "^StatefulPartitionedCall/model/depthwise_conv2d_7/depthwise/ReadVariableOp",
          "^StatefulPartitionedCall/model/depthwise_conv2d_8/depthwise/ReadVariableOp",
          "^StatefulPartitionedCall/model/depthwise_conv2d_9/depthwise/ReadVariableOp"
        ],
        "name": "Func/StatefulPartitionedCall/output_control_node/_147",
        "op": "NoOp"
      },
      {
        "input": [
          "StatefulPartitionedCall/model/batch_normalization_v1/FusedBatchNormV3",
          "StatefulPartitionedCall/model/depthwise_conv2d/depthwise/ReadVariableOp"
        ],
        "attr": {
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "padding": { "s": "U0FNRQ==" },
          "data_format": { "s": "TkhXQw==" },
          "T": { "type": "DT_FLOAT" }
        },
        "name": "StatefulPartitionedCall/model/depthwise_conv2d/depthwise",
        "op": "DepthwiseConv2dNative"
      },
      {
        "device": "/device:CPU:0",
        "input": [
          "StatefulPartitionedCall/model/depthwise_conv2d/depthwise",
          "StatefulPartitionedCall/model/conv2d_1/Conv2D_weights",
          "StatefulPartitionedCall/model/conv2d_1/Conv2D_bn_offset"
        ],
        "attr": {
          "explicit_paddings": { "list": {} },
          "epsilon": { "f": 0.0 },
          "data_format": { "s": "TkhXQw==" },
          "use_cudnn_on_gpu": { "b": true },
          "padding": { "s": "VkFMSUQ=" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" },
          "T": { "type": "DT_FLOAT" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } }
        },
        "name": "StatefulPartitionedCall/model/batch_normalization_v1_1/FusedBatchNormV3",
        "op": "_FusedConv2D"
      },
      {
        "input": [
          "StatefulPartitionedCall/model/batch_normalization_v1_1/FusedBatchNormV3",
          "StatefulPartitionedCall/model/batch_normalization_v1/FusedBatchNormV3"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } },
        "name": "StatefulPartitionedCall/model/add/add",
        "op": "AddV2"
      },
      {
        "input": [
          "StatefulPartitionedCall/model/add/add",
          "StatefulPartitionedCall/model/p_re_lu_1/Neg"
        ],
        "name": "StatefulPartitionedCall/model/p_re_lu_1/Relu",
        "op": "Prelu"
      },
      {
        "input": [
          "StatefulPartitionedCall/model/p_re_lu_1/Relu",
          "StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise/ReadVariableOp"
        ],
        "attr": {
          "padding": { "s": "U0FNRQ==" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "T": { "type": "DT_FLOAT" },
          "data_format": { "s": "TkhXQw==" }
        },
        "name": "StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise",
        "op": "DepthwiseConv2dNative"
      },
      {
        "device": "/device:CPU:0",
        "input": [
          "StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise",
          "StatefulPartitionedCall/model/conv2d_2/Conv2D_weights",
          "StatefulPartitionedCall/model/conv2d_2/Conv2D_bn_offset"
        ],
        "attr": {
          "explicit_paddings": { "list": {} },
          "epsilon": { "f": 0.0 },
          "data_format": { "s": "TkhXQw==" },
          "use_cudnn_on_gpu": { "b": true },
          "padding": { "s": "VkFMSUQ=" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" },
          "T": { "type": "DT_FLOAT" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } }
        },
        "name": "StatefulPartitionedCall/model/batch_normalization_v1_2/FusedBatchNormV3",
        "op": "_FusedConv2D"
      },
      {
        "input": [
          "StatefulPartitionedCall/model/batch_normalization_v1_2/FusedBatchNormV3",
          "StatefulPartitionedCall/model/p_re_lu_1/Relu"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } },
        "name": "StatefulPartitionedCall/model/add_1/add",
        "op": "AddV2"
      },
      {
        "input": [
          "StatefulPartitionedCall/model/add_1/add",
          "StatefulPartitionedCall/model/p_re_lu_2/Neg"
        ],
        "name": "StatefulPartitionedCall/model/p_re_lu_2/Relu",
        "op": "Prelu"
      },
      {
        "input": ["StatefulPartitionedCall/model/p_re_lu_2/Relu"],
        "attr": {
          "padding": { "s": "VkFMSUQ=" },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "data_format": { "s": "TkhXQw==" },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
          "T": { "type": "DT_FLOAT" }
        },
        "name": "StatefulPartitionedCall/model/max_pooling2d/MaxPool",
        "op": "MaxPool"
      },
      {
        "input": [
          "StatefulPartitionedCall/model/p_re_lu_2/Relu",
          "StatefulPartitionedCall/model/depthwise_conv2d_2/depthwise/ReadVariableOp"
        ],
        "attr": {
          "padding": { "s": "U0FNRQ==" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "T": { "type": "DT_FLOAT" },
          "data_format": { "s": "TkhXQw==" }
        },
