{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v1.7.0", "userDefinedMetadata": {"signature": {"inputs": {"f0_confidence:0": {"name": "f0_confidence:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "loudness_db:0": {"name": "loudness_db:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "f0_hz:0": {"name": "f0_hz:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "audio:0": {"name": "audio:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64000"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64000"}]}}}}}, "modelTopology": {"node": [{"name": "audio", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "64000"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "f0_confidence", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "f0_hz", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "loudness_db", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11", "op": "NoOp", "input": ["^audio", "^f0_confidence", "^f0_hz", "^loudness_db"]}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/random_uniform/shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/random_uniform/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/random_uniform/min", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/frame/concat_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/frame/add_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1000"}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/frame/GatherV2/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/frame/concat_3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/rfft/Pad/paddings", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/rfft/fft_length", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/BroadcastTo", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1000"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/mul_8/x", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/add_2/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/Log_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/add_3/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/zeros_like_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1000"}, {"size": "65"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/irfft/fft_length", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/fftshift_1/floordiv", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/fftshift_1/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/rfft_1/Pad/paddings", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/rfft_1/fft_length", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/irfft_1/fft_length", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/concat", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/concat_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/transpose/perm", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/concat_3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/concat_4", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/Sum/reduction_indices", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/concat_5", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/strided_slice_1/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/strided_slice_1/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add_1/strided_slice_1/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_8/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_8/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_8/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/GreaterEqual_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/zeros_like_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64000"}, {"size": "60"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/mul/x", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/Log", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "60"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/GreaterEqual/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/zeros_like", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1000"}, {"size": "60"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/mul_1/x", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/rnn_fc_decoder_2/gru/while/loop_counter", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/rnn_fc_decoder_2/gru/while/maximum_iterations", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/rnn_fc_decoder_2/gru/time", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/rnn_fc_decoder_2/gru/TensorArrayV2_1/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/rnn_fc_decoder_2/gru/zeros", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/rnn_fc_decoder_2/gru/strided_slice_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_1/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_1/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_1/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_2/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_2/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_2/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/resize/size", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_3/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_3/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_3/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/truediv_3_recip", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/add_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/Equal/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/SelectV2/t", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/mul/x", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/truediv_recip", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/truediv_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/truediv_2_recip", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/rnn_fc_decoder_2/concat/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/rnn_fc_decoder_2/gru/transpose/perm", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/rnn_fc_decoder_2/gru/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_16", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "768"}]}}}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_17", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_18", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "768"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/rnn_fc_decoder_2/gru/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/rnn_fc_decoder_2/gru/transpose_1/perm", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/rnn_fc_decoder_2/concat_1/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/rnn_fc_decoder_2/dense/Tensordot/Reshape/shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_19", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "258"}, {"size": "126"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/rnn_fc_decoder_2/dense/Tensordot/shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input/_20", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "126"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/rnn_fc_decoder_2/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/rnn_fc_decoder_2/split/split_dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/Log_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/add_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/Sum/reduction_indices", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_4/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_4/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_4/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/concat/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/transpose/perm", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_5/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_5/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_5/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_6", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add/concat", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add/concat_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add/transpose/perm", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add/concat_3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add/concat_4", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add/Sum/reduction_indices", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add/concat_5", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add/strided_slice_1/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add/strided_slice_1/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/overlap_and_add/strided_slice_1/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/transpose_1/perm", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_7/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_7/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_7/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_4/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_4/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_4/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_5/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_5/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_5/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_6/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_6/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_6/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/resize_1/size", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_7/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_7/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/strided_slice_7/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "60"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_2/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_2/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_2/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/resize/size", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_3/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_3/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/strided_slice_3/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/processor_group/mul_6", "op": "Const", "input": ["^Func/StatefulPartitionedCall/autoencoder/StatefulPartitionedCall/input_control_node/_11"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", 