{
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of2.bin",
                "group1-shard2of2.bin"
            ],
            "weights": [
                {
                    "dtype": "float32",
                    "shape": [],
                    "name": "module_apply_default/hub_input/Mul/y"
                },
                {
                    "dtype": "float32",
                    "shape": [],
                    "name": "module_apply_default/hub_input/Sub/y"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        1280,
                        1001
                    ],
                    "name": "module/MobilenetV2/Logits/Conv2d_1c_1x1/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1001
                    ],
                    "name": "module/MobilenetV2/Logits/Conv2d_1c_1x1/biases"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        3,
                        3,
                        3,
                        16
                    ],
                    "name": "module/MobilenetV2/Conv/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        16
                    ],
                    "name": "module_apply_default/MobilenetV2/Conv/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        3,
                        3,
                        16,
                        1
                    ],
                    "name": "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        16
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv/depthwise/depthwise_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        16,
                        8
                    ],
                    "name": "module/MobilenetV2/expanded_conv/project/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        8
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv/project/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        8,
                        48
                    ],
                    "name": "module/MobilenetV2/expanded_conv_1/expand/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        48
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_1/expand/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        3,
                        3,
                        48,
                        1
                    ],
                    "name": "module/MobilenetV2/expanded_conv_1/depthwise/depthwise_weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        48
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_1/depthwise/depthwise_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        48,
                        16
                    ],
                    "name": "module/MobilenetV2/expanded_conv_1/project/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        16
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_1/project/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        16,
                        96
                    ],
                    "name": "module/MobilenetV2/expanded_conv_2/expand/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        96
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_2/expand/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        3,
                        3,
                        96,
                        1
                    ],
                    "name": "module/MobilenetV2/expanded_conv_2/depthwise/depthwise_weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        96
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_2/depthwise/depthwise_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        96,
                        16
                    ],
                    "name": "module/MobilenetV2/expanded_conv_2/project/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        16
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_2/project/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        16,
                        96
                    ],
                    "name": "module/MobilenetV2/expanded_conv_3/expand/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        96
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_3/expand/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        3,
                        3,
                        96,
                        1
                    ],
                    "name": "module/MobilenetV2/expanded_conv_3/depthwise/depthwise_weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        96
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_3/depthwise/depthwise_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        96,
                        16
                    ],
                    "name": "module/MobilenetV2/expanded_conv_3/project/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        16
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_3/project/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        16,
                        96
                    ],
                    "name": "module/MobilenetV2/expanded_conv_4/expand/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        96
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_4/expand/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        3,
                        3,
                        96,
                        1
                    ],
                    "name": "module/MobilenetV2/expanded_conv_4/depthwise/depthwise_weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        96
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_4/depthwise/depthwise_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        96,
                        16
                    ],
                    "name": "module/MobilenetV2/expanded_conv_4/project/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        16
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_4/project/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        16,
                        96
                    ],
                    "name": "module/MobilenetV2/expanded_conv_5/expand/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        96
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_5/expand/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        3,
                        3,
                        96,
                        1
                    ],
                    "name": "module/MobilenetV2/expanded_conv_5/depthwise/depthwise_weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        96
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_5/depthwise/depthwise_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        96,
                        16
                    ],
                    "name": "module/MobilenetV2/expanded_conv_5/project/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        16
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_5/project/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        16,
                        96
                    ],
                    "name": "module/MobilenetV2/expanded_conv_6/expand/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        96
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_6/expand/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        3,
                        3,
                        96,
                        1
                    ],
                    "name": "module/MobilenetV2/expanded_conv_6/depthwise/depthwise_weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        96
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_6/depthwise/depthwise_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        96,
                        32
                    ],
                    "name": "module/MobilenetV2/expanded_conv_6/project/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        32
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_6/project/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        32,
                        192
                    ],
                    "name": "module/MobilenetV2/expanded_conv_7/expand/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        192
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_7/expand/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        3,
                        3,
                        192,
                        1
                    ],
                    "name": "module/MobilenetV2/expanded_conv_7/depthwise/depthwise_weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        192
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_7/depthwise/depthwise_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        192,
                        32
                    ],
                    "name": "module/MobilenetV2/expanded_conv_7/project/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        32
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_7/project/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        32,
                        192
                    ],
                    "name": "module/MobilenetV2/expanded_conv_8/expand/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        192
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_8/expand/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        3,
                        3,
                        192,
                        1
                    ],
                    "name": "module/MobilenetV2/expanded_conv_8/depthwise/depthwise_weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        192
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_8/depthwise/depthwise_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        192,
                        32
                    ],
                    "name": "module/MobilenetV2/expanded_conv_8/project/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        32
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_8/project/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        32,
                        192
                    ],
                    "name": "module/MobilenetV2/expanded_conv_9/expand/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        192
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_9/expand/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        3,
                        3,
                        192,
                        1
                    ],
                    "name": "module/MobilenetV2/expanded_conv_9/depthwise/depthwise_weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        192
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_9/depthwise/depthwise_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        192,
                        32
                    ],
                    "name": "module/MobilenetV2/expanded_conv_9/project/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        32
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_9/project/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        32,
                        192
                    ],
                    "name": "module/MobilenetV2/expanded_conv_10/expand/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        192
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_10/expand/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        3,
                        3,
                        192,
                        1
                    ],
                    "name": "module/MobilenetV2/expanded_conv_10/depthwise/depthwise_weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        192
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_10/depthwise/depthwise_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        192,
                        48
                    ],
                    "name": "module/MobilenetV2/expanded_conv_10/project/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        48
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_10/project/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        48,
                        288
                    ],
                    "name": "module/MobilenetV2/expanded_conv_11/expand/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        288
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_11/expand/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        3,
                        3,
                        288,
                        1
                    ],
                    "name": "module/MobilenetV2/expanded_conv_11/depthwise/depthwise_weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        288
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_11/depthwise/depthwise_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        288,
                        48
                    ],
                    "name": "module/MobilenetV2/expanded_conv_11/project/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        48
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_11/project/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        48,
                        288
                    ],
                    "name": "module/MobilenetV2/expanded_conv_12/expand/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        288
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_12/expand/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        3,
                        3,
                        288,
                        1
                    ],
                    "name": "module/MobilenetV2/expanded_conv_12/depthwise/depthwise_weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        288
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_12/depthwise/depthwise_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        288,
                        48
                    ],
                    "name": "module/MobilenetV2/expanded_conv_12/project/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        48
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_12/project/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        48,
                        288
                    ],
                    "name": "module/MobilenetV2/expanded_conv_13/expand/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        288
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_13/expand/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        3,
                        3,
                        288,
                        1
                    ],
                    "name": "module/MobilenetV2/expanded_conv_13/depthwise/depthwise_weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        288
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_13/depthwise/depthwise_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        288,
                        80
                    ],
                    "name": "module/MobilenetV2/expanded_conv_13/project/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        80
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_13/project/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        80,
                        480
                    ],
                    "name": "module/MobilenetV2/expanded_conv_14/expand/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        480
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_14/expand/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        3,
                        3,
                        480,
                        1
                    ],
                    "name": "module/MobilenetV2/expanded_conv_14/depthwise/depthwise_weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        480
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_14/depthwise/depthwise_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        480,
                        80
                    ],
                    "name": "module/MobilenetV2/expanded_conv_14/project/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        80
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_14/project/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        80,
                        480
                    ],
                    "name": "module/MobilenetV2/expanded_conv_15/expand/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        480
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_15/expand/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        3,
                        3,
                        480,
                        1
                    ],
                    "name": "module/MobilenetV2/expanded_conv_15/depthwise/depthwise_weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        480
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_15/depthwise/depthwise_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        480,
                        80
                    ],
                    "name": "module/MobilenetV2/expanded_conv_15/project/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        80
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_15/project/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        80,
                        480
                    ],
                    "name": "module/MobilenetV2/expanded_conv_16/expand/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        480
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_16/expand/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        3,
                        3,
                        480,
                        1
                    ],
                    "name": "module/MobilenetV2/expanded_conv_16/depthwise/depthwise_weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        480
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_16/depthwise/depthwise_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        480,
                        160
                    ],
                    "name": "module/MobilenetV2/expanded_conv_16/project/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        160
                    ],
                    "name": "module_apply_default/MobilenetV2/expanded_conv_16/project/Conv2D_bn_offset"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1,
                        1,
                        160,
                        1280
                    ],
                    "name": "module/MobilenetV2/Conv_1/weights"
                },
                {
                    "dtype": "float32",
                    "shape": [
                        1280
                    ],
                    "name": "module_apply_default/MobilenetV2/Conv_1/Conv2D_bn_offset"
                }
            ]
        }
    ],
    "modelTopology": {
        "node": [
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "shape": {
                        "shape": {
                            "dim": [
                                {
                                    "size": "-1"
                                },
                                {
                                    "size": "224"
                                },
                                {
                                    "size": "224"
                                },
                                {
                                    "size": "3"
                                }
                            ]
                        }
                    }
                },
                "name": "images",
                "op": "Placeholder"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {}
                        }
                    }
                },
                "name": "module_apply_default/hub_input/Mul/y",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {}
                        }
                    }
                },
                "name": "module_apply_default/hub_input/Sub/y",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1280"
                                    },
                                    {
                                        "size": "1001"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "module/MobilenetV2/Logits/Conv2d_1c_1x1/weights",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1001"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "module/MobilenetV2/Logits/Conv2d_1c_1x1/biases",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "16"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "module/MobilenetV2/Conv/weights",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "16"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "module_apply_default/MobilenetV2/Conv/Conv2D_bn_offset",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "16"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "16"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "module_apply_default/MobilenetV2/expanded_conv/depthwise/depthwise_bn_offset",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "16"
                                    },
                                    {
                                        "size": "8"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "module/MobilenetV2/expanded_conv/project/weights",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "8"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "module_apply_default/MobilenetV2/expanded_conv/project/Conv2D_bn_offset",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "8"
                                    },
                                    {
                                        "size": "48"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "module/MobilenetV2/expanded_conv_1/expand/weights",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "48"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "module_apply_default/MobilenetV2/expanded_conv_1/expand/Conv2D_bn_offset",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "48"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "module/MobilenetV2/expanded_conv_1/depthwise/depthwise_weights",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "48"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "module_apply_default/MobilenetV2/expanded_conv_1/depthwise/depthwise_bn_offset",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "48"
                                    },
                                    {
                                        "size": "16"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "module/MobilenetV2/expanded_conv_1/project/weights",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "16"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "module_apply_default/MobilenetV2/expanded_conv_1/project/Conv2D_bn_offset",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "16"
                                    },
                                    {
                                        "size": "96"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "module/MobilenetV2/expanded_conv_2/expand/weights",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "96"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "module_apply_default/MobilenetV2/expanded_conv_2/expand/Conv2D_bn_offset",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "96"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                },
                "name": "module/MobilenetV2/expanded_conv_2/depthwise/depthwise_weights",
                "op": "Const"
            },
            {
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "96"
                                    }
                                ]
