{
  "modelTopology": {
    "node": [
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "1536"
                  },
                  {
                    "size": "512"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/Reshape_1",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "512"
                  },
                  {
                    "size": "1536"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/Reshape_1",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "dtype": {
            "type": 1
          },
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "512"
                  }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/FFN/layer_prepostprocess/layer_norm/layer_norm_scale/ConcatPartitions/concat",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "512"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/FFN/layer_prepostprocess/layer_norm/layer_norm_bias/ConcatPartitions/concat",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "1536"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/FFN/conv1/bias/ConcatPartitions/concat",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "512"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/FFN/conv2/bias/ConcatPartitions/concat",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": []
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/mul/y",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "512"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/layer_prepostprocess/layer_norm/layer_norm_scale/ConcatPartitions/concat",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "512"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/layer_prepostprocess/layer_norm/layer_norm_bias/ConcatPartitions/concat",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "512"
                  },
                  {
                    "size": "1536"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/MultiheadAttention/qkv_transform_single/kernel/part_0",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "1536"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/MultiheadAttention/qkv_transform_single/bias/ConcatPartitions/concat",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 3,
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 3
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/Const",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 3,
              "tensorShape": {
                "dim": []
              }
            }
          },
          "dtype": {
            "type": 3
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/Reshape/shape/3",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 3,
              "tensorShape": {
                "dim": []
              }
            }
          },
          "dtype": {
            "type": 3
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/combine_heads/combine_last_two_dimensions/Reshape/shape/2",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "512"
                  },
                  {
                    "size": "512"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/MultiheadAttention/output_transform_single/kernel/part_0",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "512"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_1/TransformerLayer/MultiheadAttention/output_transform_single/bias/ConcatPartitions/concat",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "1536"
                  },
                  {
                    "size": "512"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv2/Tensordot/Reshape_1",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "512"
                  },
                  {
                    "size": "1536"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/FFN/conv1/Tensordot/Reshape_1",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "512"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/FFN/layer_prepostprocess/layer_norm/layer_norm_scale/ConcatPartitions/concat",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "512"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/FFN/layer_prepostprocess/layer_norm/layer_norm_bias/ConcatPartitions/concat",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 3,
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 3
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/Const_2",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "1536"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/FFN/conv1/bias/ConcatPartitions/concat",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 3,
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 3
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/Const_2",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "512"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/FFN/conv2/bias/ConcatPartitions/concat",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 3,
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 3
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/BaseDotProductAttention/Slice/begin",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": []
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/mul/y",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "dtype": {
            "type": 1
          },
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": []
              }
            }
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/DotProductAttention/attention_bias_ignore_padding/mul/y",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "256"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/layer_prepostprocess/layer_norm/layer_norm_scale/ConcatPartitions/concat",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": []
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Cast/x",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "dtype": {
            "type": 1
          },
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "256"
                  }
                ]
              }
            }
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/layer_prepostprocess/layer_norm/layer_norm_bias/ConcatPartitions/concat",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "256"
                  },
                  {
                    "size": "768"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/MultiheadAttention/qkv_transform_single/kernel/part_0",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "768"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/MultiheadAttention/qkv_transform_single/bias/ConcatPartitions/concat",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 3,
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 3
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/Const",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 3,
              "tensorShape": {
                "dim": []
              }
            }
          },
          "dtype": {
            "type": 3
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/Reshape/shape/2",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 3,
              "tensorShape": {
                "dim": []
              }
            }
          },
          "dtype": {
            "type": 3
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/split_heads/split_last_dimension/Reshape/shape/3",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 3,
              "tensorShape": {
                "dim": [
                  {
                    "size": "4"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 3
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/split_heads/transpose/perm",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 3,
              "tensorShape": {
                "dim": []
              }
            }
          },
          "dtype": {
            "type": 3
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/TransformerLayer/MultiheadAttention/combine_heads/combine_last_two_dimensions/Reshape/shape/2",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "256"
                  },
                  {
                    "size": "512"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/MultiheadAttention/output_transform_single/kernel/part_0",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "512"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/MultiheadAttention/output_transform_single/bias/ConcatPartitions/concat",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "8002"
                  },
                  {
                    "size": "256"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module/Embeddings_en",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "128"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/TimingSignal/ExpandDims_1",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "256"
                  },
                  {
                    "size": "512"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/dense/kernel/ConcatPartitions/concat",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "512"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/Layer_0/TransformerLayer/dense/bias/ConcatPartitions/concat",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 3,
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 3
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv2/Tensordot/Const",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 3,
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 3
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/add_1",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 3,
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 3
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/Scatter/strided_slice/stack",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 3,
              "tensorShape": {
                "dim": []
              }
            }
          },
          "dtype": {
            "type": 3
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/SequenceMask/ExpandDims/dim",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 3,
              "tensorShape": {
                "dim": []
              }
            }
          },
          "dtype": {
            "type": 3
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/MultiheadAttention/ExpandDims/dim",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 9,
              "tensorShape": {
                "dim": []
              }
            }
          },
          "dtype": {
            "type": 9
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/Const",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 9,
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 9
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/ones_like",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "dtype": {
            "type": 9
          },
          "shape": {
            "shape": {
              "dim": [
                {
                  "size": "-1"
                },
                {
                  "size": "2"
                }
              ]
            }
          }
        },
        "name": "indices",
        "op": "Placeholder"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 3,
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 3
          }
        },
        "name": "ConstantFolding/module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/conv1/Tensordot/ListDiff-folded-0",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 3,
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 3
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/strided_slice_2/stack_1",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 3,
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 3
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_0/AddTimingSignal/strided_slice_2/stack_2",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 9,
              "tensorShape": {
                "dim": []
              }
            }
          },
          "dtype": {
            "type": 9
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/ClipToMaxLength/Less/y",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 3,
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 3
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/TransformerStack/Layer_1/TransformerLayer/FFN/layer_prepostprocess/layer_norm/Mean/reduction_indices",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 3,
              "tensorShape": {
                "dim": []
              }
            }
          },
          "dtype": {
            "type": 3
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/SequenceMask/Const",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "dtype": {
            "type": 9
          },
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 9,
              "tensorShape": {
                "dim": []
              }
            }
          }
        },
        "name": "module_apply_default/Encoder_en/KonaTransformer/Encode/SparseToDense/default_value",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "512"
                  },
                  {
                    "size": "512"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module/Encoder_en/hidden_layers/tanh_layer_0/weights",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 1,
              "tensorShape": {
                "dim": [
                  {
                    "size": "512"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": 1
          }
        },
        "name": "module/Encoder_en/hidden_layers/tanh_layer_0/bias",
        "op": "Const"
      },
      {
        "input": [],
        "attr": {
          "value": {
            "tensor": {
              "floatVal": [],
              "doubleVal": [],
              "intVal": [],
              "stringVal": [],
              "scomplexVal": [],
              "int64Val": [],
              "boolVal": [],
              "uint32Val": [],
              "uint64Val": [],
              "dtype": 3,
              "tensorShape": {
                "dim": []
              }
            }
          },
          "dtype": {
            "type": 3
          }
        },
